from ctypes import windll


"""
############################################################
    Файл со всеми константами использующимися в программе
############################################################
"""

"""
############################################################
    Численные константы
############################################################
"""

spacing_in_main = 100  # отступ между элементами
width = windll.user32.GetSystemMetrics(0)  # ширина экрана
height = windll.user32.GetSystemMetrics(1)  # высота экрана

"""
############################################################
    Строковые константы
############################################################
"""

bl_hor = 'horizontal'  # горизонтальный бокс лайаут
bl_ver = 'vertical'  # вертикальный бокс лайаут

"""
############################################################
    Кортежные константы
############################################################
"""

invisible_background_color = (0,) * 4  # невидимый задний фон
padding_in_main = (200,) * 4  # падинги в мейне (чтоб тип на разных страницах)
black = (0, 0, 0, 1)  # черный цвет
main_font_size = 60  # размер шрифта на главной странице

"""
############################################################
    Статические файлы
############################################################
"""

picture_in_main = r'static\1.jpg'  # картинка в мейне
font = r'static\ofont.ru_a_BodoniNovaNr.ttf'  # шрифты

"""
############################################################
    Статические словари
############################################################
"""

main_buttons = {'background_color': invisible_background_color,
                'font_name': font,
                'color': black,
                'font_size': main_font_size}
